# CannotEditDeletedWorkset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotEditDeletedWorkset Property
BuiltInFailures..::..EditingFailures Class See Also
---
This action has caused deletion of non-editable Workset ' [Name] '.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotEditDeletedWorkset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotEditDeletedWorkset As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotEditDeletedWorkset {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace